In [1]:
# Import related packages

import numpy as np
import pandas as pd

In [2]:
# Related data

A1 = pd.DataFrame([[12, np.nan, 23, 25 ],
                   [18, None, 52, 34 ],
                   [np.nan, 14, 39, None],
                   [37, 76, 19, 10 ],
                   [47, 66, 29, 1 ]])

C1_index = [('California', 2000), ('California', 2010),
            ('New York', 2000), ('New York', 2010),
            ('Texas', 2000), ('Texas', 2010)]

populations = [33871648, 37253956, 18976457, 19378102, 20851820, 25145561]

C1 = pd.Series(populations, index=C1_index)

Data = np.round(np.random.randn(4, 6), 1)
Data[:, ::2] *= 10
Data += 37

H1=pd.DataFrame([['A1','B1','C1'],['A2','B2','C2']], index=['1','2'], columns=['A','B','C'])
H2=pd.DataFrame([['B3','C3','D3'],['B4','C4','D4']], index=['1','2'], columns=['B','C','D'])

# Q1

In [14]:
A1 = pd.DataFrame([[12, np.nan, 23, 25 ],
                   [18, None, 52, 34 ],
                   [np.nan, 14, 39, None],
                   [37, 76, 19, 10 ],
                   [47, 66, 29, 1 ]],
                 columns=list('ABCD'))
print(A1)

      A     B   C     D
0  12.0   NaN  23  25.0
1  18.0   NaN  52  34.0
2   NaN  14.0  39   NaN
3  37.0  76.0  19  10.0
4  47.0  66.0  29   1.0

In [15]:
A1.isnull()

       A      B      C      D
0  False   True  False  False
1  False   True  False  False
2   True  False  False   True
3  False  False  False  False
4  False  False  False  False

In [16]:
Q1_3=A1.dropna()
Q1_3

      A     B   C     D
3  37.0  76.0  19  10.0
4  47.0  66.0  29   1.0

In [17]:
Q1_4=A1.dropna(axis=1)
Q1_4

    C
0  23
1  52
2  39
3  19
4  29

In [33]:
Q1_5=A1.dropna(axis='columns',thresh=4)
Q1_5

      A   C     D
0  12.0  23  25.0
1  18.0  52  34.0
2   NaN  39   NaN
3  37.0  19  10.0
4  47.0  29   1.0

# Q2

In [34]:
print(A1)

      A     B   C     D
0  12.0   NaN  23  25.0
1  18.0   NaN  52  34.0
2   NaN  14.0  39   NaN
3  37.0  76.0  19  10.0
4  47.0  66.0  29   1.0

In [59]:
index={'A':0, 'B':1, 'C':2, 'D':3}
Q2_2=A1.fillna(value=index)
Q2_2

      A     B   C     D
0  12.0   1.0  23  25.0
1  18.0   1.0  52  34.0
2   0.0  14.0  39   3.0
3  37.0  76.0  19  10.0
4  47.0  66.0  29   1.0

In [60]:
index={'A':0, 'B':1, 'C':2, 'D':3}
Q2_3=A1.fillna(value=index,limit=1)
Q2_3

      A     B   C     D
0  12.0   1.0  23  25.0
1  18.0   NaN  52  34.0
2   0.0  14.0  39   3.0
3  37.0  76.0  19  10.0
4  47.0  66.0  29   1.0

In [62]:
Q2_4=A1.fillna(axis=1,method='ffill')
Q2_4

      A     B     C     D
0  12.0  12.0  23.0  25.0
1  18.0  18.0  52.0  34.0
2   NaN  14.0  39.0  39.0
3  37.0  76.0  19.0  10.0
4  47.0  66.0  29.0   1.0

# Q3

In [64]:
# Run before the start of answering question 3

C1_index = [('California', 2000), ('California', 2010),
            ('New York', 2000), ('New York', 2010),
            ('Texas', 2000), ('Texas', 2010)]


populations = [33871648, 37253956, 18976457, 19378102, 20851820, 25145561]

In [67]:
# a. print C1
# That is a Series multi-indexing

C1 = pd.Series(populations, index=C1_index)
print(C1)

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [73]:
print(C1_index)

[('California', 2000), ('California', 2010), ('New York', 2000), ('New York', 2010), ('Texas', 2000), ('Texas', 2010)]

In [90]:
C1_c = pd.Series(populations, index=C1_index)
print(C1_c)

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [91]:
C1d = C1_c.reindex(index)
print(C1d)

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [94]:
C1e = C1d.unstack()
print(C1e)

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [96]:
C1f=C1e.stack()
print(C1f)

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

# Q4

In [121]:
levels=[[2013, 2014], [1, 2]]
names=['year', 'visit']
row_index=pd.MultiIndex.from_product([[2013, 2014], [1, 2]],names=['year', 'visit'])
print(row_index)

MultiIndex([(2013, 1),
            (2013, 2),
            (2014, 1),
            (2014, 2)],
           names=['year', 'visit'])

In [127]:
levels=[['Bob', 'Guido', 'Sue'], ['HR', 'Temp']]
names=['patient', 'measurement']
column_index=pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],names=['patient', 'measurement'])
print(column_index)

MultiIndex([(  'Bob',   'HR'),
            (  'Bob', 'Temp'),
            ('Guido',   'HR'),
            ('Guido', 'Temp'),
            (  'Sue',   'HR'),
            (  'Sue', 'Temp')],
           names=['patient', 'measurement'])

In [139]:
print(Data)

[[49.  36.2 42.  36.8 50.  36.3]
 [25.  37.2 38.  35.4 59.  37.9]
 [31.  36.7 33.  37.2 33.  38.1]
 [42.  37.2 49.  37.2 24.  35.5]]

In [176]:
D2=pd.DataFrame(Data,columns=column_index,index=row_index)
print(D2)

patient       Bob       Guido         Sue
measurement    HR  Temp    HR  Temp    HR  Temp
year visit
2013 1       49.0  36.2  42.0  36.8  50.0  36.3
     2       25.0  37.2  38.0  35.4  59.0  37.9
2014 1       31.0  36.7  33.0  37.2  33.0  38.1
     2       42.0  37.2  49.0  37.2  24.0  35.5

# Q5

In [177]:
print(D2)

patient       Bob       Guido         Sue
measurement    HR  Temp    HR  Temp    HR  Temp
year visit
2013 1       49.0  36.2  42.0  36.8  50.0  36.3
     2       25.0  37.2  38.0  35.4  59.0  37.9
2014 1       31.0  36.7  33.0  37.2  33.0  38.1
     2       42.0  37.2  49.0  37.2  24.0  35.5

In [179]:
D2['Sue']

measurement    HR  Temp
year visit
2013 1       50.0  36.3
     2       59.0  37.9
2014 1       33.0  38.1
     2       24.0  35.5

In [180]:
D2['Sue','HR']

year  visit
2013  1        50.0
      2        59.0
2014  1        33.0
      2        24.0
Name: (Sue, HR), dtype: float64

In [181]:
D2.iloc[2:4,2:4]

patient     Guido
measurement    HR  Temp
year visit
2014 1       33.0  37.2
     2       49.0  37.2

In [192]:
D2.loc[2013,('Guido','HR')]

visit
1    42.0
2    38.0
Name: (Guido, HR), dtype: float64

In [191]:
Q5_5=pd.IndexSlice
D2.loc[Q5_5[:,2:2],Q5_5['BOB':'Sue','Temp']]

patient       Bob Guido   Sue
measurement  Temp  Temp  Temp
year visit
2013 2       37.2  35.4  37.9
2014 2       37.2  37.2  35.5

# Q6

In [193]:
print(D2)

patient       Bob       Guido         Sue
measurement    HR  Temp    HR  Temp    HR  Temp
year visit
2013 1       49.0  36.2  42.0  36.8  50.0  36.3
     2       25.0  37.2  38.0  35.4  59.0  37.9
2014 1       31.0  36.7  33.0  37.2  33.0  38.1
     2       42.0  37.2  49.0  37.2  24.0  35.5

In [197]:
Q6_2=D2.sum(level= 'visit')
Q6_2

C:\Users\ethan tsai\AppData\Local\Temp\ipykernel_5704\3411268360.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  Q6_2=D2.sum(level='visit')

patient       Bob       Guido         Sue
measurement    HR  Temp    HR  Temp    HR  Temp
visit
1            80.0  72.9  75.0  74.0  83.0  74.4
2            67.0  74.4  87.0  72.6  83.0  73.4

In [199]:
Q6_3=D2.sum(axis=1,level='patient')
Q6_3

C:\Users\ethan tsai\AppData\Local\Temp\ipykernel_5704\2730617594.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  Q6_3=D2.sum(axis=1,level='patient')

patient      Bob  Guido   Sue
year visit
2013 1      85.2   78.8  86.3
     2      62.2   73.4  96.9
2014 1      67.7   70.2  71.1
     2      79.2   86.2  59.5

# Q7

In [200]:
print(H1)

    A   B   C
1  A1  B1  C1
2  A2  B2  C2

In [201]:
print(H2)

    B   C   D
1  B3  C3  D3
2  B4  C4  D4

In [203]:
pd.concat([H1,H2])

     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
1  NaN  B3  C3   D3
2  NaN  B4  C4   D4

In [207]:
pd.concat([H1,H2],axis=0,ignore_index=True)

     A   B   C    D
0   A1  B1  C1  NaN
1   A2  B2  C2  NaN
2  NaN  B3  C3   D3
3  NaN  B4  C4   D4